{
    "num": 2,
    "Posts": [
        {
            "sender_name": "jaja",
            "title": "CS2 skins explained: Rarity, types & marketplace",
            "time": "2025-08-07 23:11",
            "content": [
                {
                    "text": "CS2 skins are cosmetics that change how your guns, knives, and gloves look. There are also Agent skins that change your character model. \n\nCounter-Strike skins are purely cosmetic, in that they are not designed to change any gameplay aspect of CS, although some players might feel their best using their favourite guns or knives. Despite not having an appreciable effect in-game, CS2 skins are highly sought-after items owing to their rarity and monetary value.\n\nSeveral variables make up every skin. Each variable directly impacts the value of the rare CS2 skins you will unbox or buy. In a broad sense, the value of a weapon is primarily determined by its rarity coupled with its desirability.\n\nCondition, Wear, and Float all refer to the condition of the weapon’s finish. Starting with Factory New and ending with Battle-Scarred, all CS2 weapons with a skin exist on a spectrum of wear from 0 to 1. \n\nFactory New weapons will have the skin’s design largely intact, with higher ratings having more and more imperfections.\n\nGenerally speaking, weapons with less wear are more valuable on the market; however, extremely high float skins can be valuable if they are unusually high in that regard.\n\n",
                    "boxes": [
                        {
                            "type": 1,
                            "name": "AK-47 Inheritance"
                        },
                        {
                            "type": 1,
                            "name": "MP9 Starlight Protector"
                        }
                    ]
                },
                {
                    "text": "Some CS2 skins are ‘Pattern-based’, with each weapon having a Pattern Template ranging from 0-1000. For Pattern-based skins, this number determines which part of the texture’s base image is superimposed onto the gun.\n\nEach theoretical pattern is rare, as there are 1,001 potential patterns, but some are more desirable due to the finish. For example, ‘Blue Gems’ are Case Hardened CS2 skins with an unusual amount of blue as part of the weapon. The best possible patterns for Blue Gems are among the most expensive skins in the game.\n\nDoppler and Gamma Doppler knives have a similar system. Knives can be one of several variations, with the rarest type once again referred to as ‘Gems’ by the CS2 community. \n\nA Doppler knife can be a Sapphire 1 (1 in 100), Ruby (1 in 100), or Black Pearl (1 in 1000), and a Gamma Doppler can be an Emerald (1 in 100), with the remaining probabilities shared between Phases 1-4 of each knife.",
                    "boxes": []
                }
            ],
            "id": 0
        },
        {
            "sender_name": "jaja",
            "title": "POP AWP Guide: All Rare Seed Patterns",
            "time": "2025-08-08 23:27",
            "content": [
                {
                    "text": "The AWP is, without a doubt, one of the most iconic weapons in the history of Counter-Strike. Capable of eliminating enemies with a single body shot at all ranges, the AWP has found widespread use across all stages of the CS2 meta despite its heavy price tag.\n\nGiven the overwhelming popularity of the AWP in Counter-Strike 2, many players are drawn to acquiring some fancy skins for this gun. As a result, the AWP also boasts one of the most extensive collections of available skins in CS2. From more affordable options like the AWP Pit Viper to premium variants such as the AWP Medusa, there exists a diverse range of choices to cater to every player’s preference and budget.\n\nIf you’re in the market for an AWP skin in CS2, then you may find yourself getting easily overwhelmed by the sheer number of options you have while scrolling through the Steam Market. However, if you’re looking to truly stand out from your competitors on the virtual battlefields without breaking the bank, the POP AWP might be an ideal choice for you.\n\nWhat makes the POP AWP an extremely desirable AWP skin among casual players and collectors alike is the number of distinctive patterns that the skin features. These patterns are commonly known as ‘rare patterns’ and typically demand higher prices than the skins’s standard variants.\n\nReady to know more about the rare patterns on the POP AWP and how you can get one for yourself? Look no further.\n\nThe POP AWP can have a bunch of unique patterns on the skin with the playside of the gun showcasing various words and symbols inscribed on it.\n\nWhile some players might just be interested in grabbing the ‘Max White’ patterns for the POP AWP, other players might be more inclined to get a variant that has some words inscribed in it like the ‘упражнят’ patterns, ‘bcя’ patterns, or ‘Hж6’ patterns.\n\nSome other intriguing patterns for the POP AWP include the ‘Checkerboard’ patterns, ‘Circle’ patterns, and the ‘SUS’ patterns, the latter of which may evoke nostalgia for the Among Us era.\n\nTo make it easier for our readers to understand all the different rare patterns of the POP AWP, we have divided the patterns into several categories and compiled them in a table.\n\n",
                    "boxes": []
                }
            ],
            "id": 0
        },
        {
            "sender_name": "jaja",
            "title": "Deagle Emerald Jörmungandr Guide",
            "time": "2025-08-08 23:35",
            "content": [
                {
                    "text": "  The Desert Eagle needs no introduction in the world of Counter-Strike. Due to its capability to eliminate opponents with a single headshot at all ranges, the Deagle finds itself being one of the most widely used weapons in the game, especially during eco and force-buy rounds when players are running low on money\n  Given the widespread acclaim for the Deagle, many players find themselves inclined to acquire an impressive skin for this iconic pistol. And when it comes to Desert Eagle skins, players aren’t facing a lack of options anytime soon. Amid the array of gorgeous Deagle skins available for purchase on the Steam market, one standout is the captivating Deagle Emerald Jörmungandr, a skin that eclipses nearly all others in terms of intrigue and allure.\n  Originally introduced as part of the Norse Collection alongside the release of Operation Shattered Web in November 2019, the Emerald Jörmungandr is undoubtedly one of the finest skins for the Deagle that you can get in CS2. Despite being more expensive than many other Deagle skins in the game, its rarity and distinctive patterns more than justify the cost.\n  Curious to find out more about the rare patterns of the Deagle Emerald Jörmungandr? We got you covered.",
                    "boxes": []
                }
            ],
            "id": 0
        }
    ],
    "id": 1
}